Revit 2026 API

# MeshFromGeometryOperationResult Methods

---

The MeshFromGeometryOperationResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetIssues | Returns the array of issues encountered while building a mesh. |
|  | GetMesh | This returns a valid mesh only for the first call. Later calls will throw an exception as the mesh is no longer valid in this object. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

MeshFromGeometryOperationResult Class

Autodesk.Revit.DB Namespace